# SQL Lesson 17: Altering tables

À mesure que vos données changent au fil du temps, SQL vous permet de mettre à jour vos tables et schémas de base de données correspondants en utilisant l' instruction **ALTER TABLE** pour ajouter, supprimer ou modifier des colonnes et des contraintes de table.

## Ajouter des colonnes

La syntaxe pour ajouter une nouvelle colonne est similaire à la syntaxe lors de la création de nouvelles lignes dans l' instruction **CREATE TABLE**.

Vous devez spécifier le type de données de la colonne ainsi que toutes les contraintes de table potentielles et les valeurs par défaut à appliquer aux lignes existantes et nouvelles. Dans certaines bases de données comme MySQL, vous pouvez même spécifier où insérer la nouvelle colonne à l'aide des clauses **FIRST** ou **AFTER**, bien que ce ne soit pas une fonctionnalité standard.

Modifier le tableau pour ajouter de nouvelles colonnes
``` mysql 
ALTER TABLE mytable
ADD column DataType OptionalTableConstraint 
    DEFAULT default_value;
```

## Supprimer des colonnes

Supprimer des colonnes est aussi simple que de spécifier la colonne à supprimer, cependant, certaines bases de données (y compris SQLite) ne prennent pas en charge cette fonctionnalité. Au lieu de cela, vous devrez peut-être créer une nouvelle table et migrer les données

Modifier le tableau pour supprimer la ou les colonnes
``` mysql 
ALTER TABLE mytable
DROP column_to_be_deleted;
```

## Renommer la table

Si vous devez renommer la table elle-même, vous pouvez également le faire en utilisant la clause **RENAME TO** de l'instruction.

Modification du nom de la table
``` mysql 
ALTER TABLE mytable
RENAME TO new_table_name;
```

## Autres changements

Chaque implémentation de base de données prend en charge différentes méthodes de modification de leurs tables, il est donc toujours préférable de consulter la documentation de votre base de données avant de continuer: MySQL , Postgres , SQLite , Microsoft SQL Server

## Exercise

Nos exercices utilisent une implémentation qui ne prend en charge que l'ajout de nouvelles colonnes, alors essayez ci-dessous.

**IMPORTANT : Afin de répondre aux questions de l'exercise d'insérer la requête entre les doubles quotes " "**

In [1]:
import pandas as pd

def to_df(s):
    l= [elt.split(';') for elt in s.replace("	", ";").split('\n')]
    return pd.DataFrame(l[1:], columns=l[0])

In [2]:
from pandasql import sqldf

In [3]:
x="""Id	Title	Director	Year	Length_minutes
1	Toy Story	John Lasseter	1995	81
2	A Bug's Life	John Lasseter	1998	95
3	Toy Story 2	John Lasseter	1999	93
4	Monsters, Inc.	Pete Docter	2001	92
5	Finding Nemo	Andrew Stanton	2003	107
6	The Incredibles	Brad Bird	2004	116
7	Cars	John Lasseter	2006	117
8	Ratatouille	Brad Bird	2007	115
9	WALL-E	Andrew Stanton	2008	104
10	Up	Pete Docter	2009	101
11	Toy Story 3	Lee Unkrich	2010	103
12	Cars 2	John Lasseter	2011	120
13	Brave	Brenda Chapman	2012	102
14	Monsters University	Dan Scanlon	2013	110"""
Movies = to_df(x)

In [4]:
Movies

    Id                Title        Director  Year Length_minutes
0    1            Toy Story   John Lasseter  1995             81
1    2         A Bug's Life   John Lasseter  1998             95
2    3          Toy Story 2   John Lasseter  1999             93
3    4       Monsters, Inc.     Pete Docter  2001             92
4    5         Finding Nemo  Andrew Stanton  2003            107
5    6      The Incredibles       Brad Bird  2004            116
6    7                 Cars   John Lasseter  2006            117
7    8          Ratatouille       Brad Bird  2007            115
8    9               WALL-E  Andrew Stanton  2008            104
9   10                   Up     Pete Docter  2009            101
10  11          Toy Story 3     Lee Unkrich  2010            103
11  12               Cars 2   John Lasseter  2011            120
12  13                Brave  Brenda Chapman  2012            102
13  14  Monsters University     Dan Scanlon  2013            110

1. Ajoutez une colonne nommée Aspect_ratio avec un type de données FLOAT pour stocker le rapport hauteur / largeur dans lequel chaque film a été publié.

In [5]:
QUERY1 = "ALTER TABLE Movies ADD Aspect_ratio FLOAT DEFAULT 0.0"

In [6]:
sqldf(QUERY1)

PandaSQLException: (sqlite3.OperationalError) no such table: Movies
[SQL: ALTER TABLE Movies ADD Aspect_ratio FLOAT DEFAULT 0.0]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

2. Ajoutez une autre colonne nommée Langue avec un type de données TEXT pour stocker la langue dans laquelle le film a été publié. Assurez-vous que la langue par défaut pour cette langue est l' anglais .

In [ ]:
QUERY2 = "ALTER TABLE Movies ADD Langue TEXT DEFAULT 'English'"

In [ ]:
sqldf(QUERY2)